using UnityEngine;
namespace KID
{
    public class 練習_7_屬性 : MonoBehaviour
    {
        // 定義一個"唯讀"屬性血量
        [SerializeField , Header("血量"),Range(0,100)]
        private float _hp = 100;
        // 血量屬性會傳回當前的血量值
        public float hp 
        {
            get
            {
                if (_hp <= 0) Debug.Log("<color=#3f3>玩家角色已經死亡</color>");
                return _hp;
            }
        }

        private void Update()
        {
             Debug.Log(hp);
        }

        // 如果血量小於等於零則會傳回值以及輸出訊息提示玩家角色死亡





        // 不規格陣列
        private string[][] names1 = new string[5][];
        private void Start()
        {
            names1[0] = new string[] { "阿塔", "維羅", "古木", "諾可西", "伯頓", "艾瑞", "贊尼爾", "克萊斯", "渥馬爾", "塔拉", "薩尼", "牛魔王", "歐米茄", "美娜", "安格列", "筱清", "葉娜", "埃羅" };
            names1[1] = new string[] { "狄拉克", "依夏", "達爾西", "瀾", "瑪迦", "閃電俠", "莉莉安", "圖倫", "伊耿士", "齊爾", "拉茲", "金納", "娜塔亞", "穆加爵", "克里希", "哥德爾", "卡莉", "盧蜜亞", "蘿兒", "貂蟬", "阿萊斯特", "薇菈", "阿茲卡" };
            names1[2] = new string[] { "阿塔", "維羅", "古木", "諾可西", "伯頓", "艾瑞", "贊尼爾", "克萊斯", "渥馬爾", "塔拉", "薩尼", "牛魔王", "歐米茄", "美娜", "安格列", "筱清", "葉娜", "埃羅", "緋淚", "弗洛倫", "瑞克", "艾蜜莉", "洛克", "夜叉", "麥克斯", "神力女超人", "龍馬", "艾翠絲", "阿杜恩", "凱格路士", "超人", "祖卡", "司科德", "莫托斯", "馬洛斯", "趙雲", "瑟斐斯", "呂布" };
            names1[3] = new string[] { "齊爾", "莫拉", "悟空", "蝙蝠俠", "刀鋒寶貝", "蘭鐸", "瑟斐斯", "納克羅斯", "阿杜恩", "瑪奇", "納達",  "帕米拉", "卡蘭", "納達", "閃電俠" };


            Debug.Log($"<color=#f33>傳說對決的坦克英雄有：{names1[0][0]}</color>");
        }
        



    }
}

